<template>
  <div class="about">

    <h1>
      Реализация ТЗ, оно привеено внизу этой страницы
    </h1>
    <h2>Тестовая страница</h2>
    При каждом обновлении страницы генерируется случайный набор передатчиков и движения приёмника.
    Координаты приёмников и как бы получаемые ими сигналы появляются в правой части страницы после генерации,
    их можно скопировать в файл, чтобы проверить в основной части

    <b>Message: Average error</b> показывает среднее значение отклонения той точки, которая была определена алгоритмов на основе сигналов,
    от настоящего расположения точки в данный момент

    <h1>Тестовое задание на вакансию «Разработчик JavaScript»</h1>

    <b>Максимальный срок выполнения 5 дней.</b>
    На плоскости расположены 3 статичных радиоприемника (гарантируется, что они не лежат на одной прямой) и один движущийся радиопередатчик. Через равные промежутки времени (1 секунда) радиоприемники замеряют время пролета сигнала от радиопередатчика до них (скорость сигнала считать равной 1000 км/сек). Необходимо по имеющимся координатам радиоприемников и по их показаниям восстановить траекторию движения радиопередатчика. Показания радиоприемников могут иметь погрешность.
    Требуется разработать одностраничное веб-приложение, в которое загружается файл через браузер с показаниями радиоприемников, (формат файла описан далее). По нажатию специальной кнопки, в браузере рисуется положение радиоприемников и траектория движения радиопередатчика в виде ломаной линии. Координаты положения радиоприемника выделяются точками на линии и выводятся отдельным списком.
    Задача должна быть решена средствами JavaScript, все вычисления, касающиеся решения задачи, должны производиться в браузере. Ограничений по визуализации и дизайну нет. Главное, чтобы происходящее в ней было понятно человеку, прочитавшему этот документ.
    Следует учитывать, что на выходе ожидается лишь приблизительная траектория, в которой допускается погрешность, ввиду шумных входных данных.
    Формат входных данных - текстовый: <br />
    x1,y1,x2,y2,x3,y3 	: координаты статичных приемников<br />
    dt1,dt2,dt3 		: время прохождения сигнала до трех точек, 1 измерение<br />
    …<br />
    d1,d2,d3 		: время прохождения сигнала до трех точек, n измерение<br />

  </div>
</template>

<style>
  .about {
    width: 95%;
    max-width: 1100px;
    background: #433d38;
    margin: auto;
    height: calc(100vh - 300px);
    padding: 20px;
  }
</style>